# Import library

In [1]:
import pandas as pd

# Load dataset

In [2]:
df = pd.read_csv("TokoBuku.csv")
df

,id_transaksi,jenis_item,jumlah,tanggal pembelian,nama_customer,total
0,133889.0,Alat Tulis,1,1/1/2010,Stacy Campos,120000.0
1,133889.0,Buku Sejarah,1,1/1/2010,Stacy Campos,150000.0
2,133889.0,Buku Anak-Anak,2,1/1/2010,Stacy Campos,400000.0
3,133889.0,Majalah Fashion,1,1/1/2010,Stacy Campos,130000.0
4,133889.0,Majalah Berita,2,1/1/2010,Stacy Campos,600000.0
...,...,...,...,...,...,...
3235,NaN,NaN,2,4/30/2024,NaN,240000.0
3236,NaN,NaN,6,4/30/2024,NaN,1800000.0
3237,NaN,NaN,1,4/30/2024,NaN,90000.0
3238,NaN,NaN,9,4/30/2024,NaN,180000.0
3239,NaN,NaN,1,4/30/2024,NaN,100000.0

# Dataset item type

In [3]:
# Mengambil daftar item dari kolom 'jenis_item'
unique_items_list = df['jenis_item'].dropna().unique().tolist()

# Menampilkan daftar item
unique_items_list

['Alat Tulis',
 'Buku Sejarah',
 'Buku Anak-Anak',
 'Majalah Fashion',
 'Majalah Berita',
 'Buku Fiksi',
 'Novel Romansa',
 'Majalah Seni',
 'Buku Biografi',
 'Aksesoris Buku',
 'Novel Fiksi Ilmiah',
 'Novel Misteri']

# Eksplorasi dataset

In [4]:
# Menampilkan informasi umum tentang dataset
print("\nInfo Dataset:\n")
df.info()

# Menampilkan jumlah missing values (NaN) per kolom
print("\nMissing Values:\n", df.isnull().sum())

# Menghitung total nilai missing values di seluruh dataset
total_missingvalues = df.isna().sum().sum()
print("\nTotal nilai Missing Values di seluruh dataset:", total_missingvalues)

Info Dataset:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3240 entries, 0 to 3239
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id_transaksi       2469 non-null   float64
 1   jenis_item         2469 non-null   object
 2   jumlah             3240 non-null   int64
 3   tanggal pembelian  3237 non-null   object
 4   nama_customer      2469 non-null   object
 5   total              3238 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 152.0+ KB

Missing Values:
 id_transaksi         771
jenis_item           771
jumlah                 0
tanggal pembelian      3
nama_customer        771
total                  2
dtype: int64

Total nilai Missing Values di seluruh dataset: 2318

# Identifikasi nilai yang hilang

In [5]:
# Menyaring semua baris dalam dataset yang memiliki minimal satu nilai kosong (NaN)
data_missingvalues = df[df.isna().any(axis=1)]

# Menampilkan jumlah baris yang mengandung Missing Values
print("Jumlah baris yang mengandung Missing Values:", len(data_missingvalues))

# Menampilkan isi dari baris-baris tersebut
print("\nData yang mengandung Missing Values:")
print(data_missingvalues)

Jumlah baris yang mengandung Missing Values: 776

Data yang mengandung Missing Values:
      id_transaksi          jenis_item  jumlah tanggal pembelian  \
188       133921.0      Majalah Berita       3         5/30/2013
201       133923.0       Novel Misteri       7               NaN
246       133931.0      Majalah Berita       4               NaN
247       133931.0  Novel Fiksi Ilmiah       4               NaN
251       133932.0      Majalah Berita       9         1/27/2014
...            ...                 ...     ...               ...
3235           NaN                 NaN       2         4/30/2024
3236           NaN                 NaN       6         4/30/2024
3237           NaN                 NaN       1         4/30/2024
3238           NaN                 NaN       9         4/30/2024
3239           NaN                 NaN       1         4/30/2024

         nama_customer      total
188   Michael Buchanan        NaN
201      Angela Conway   140000.0
246    Jaclyn Atkinson  2080000.0
247    Jaclyn Atkinson   400000.0
251    Chad Harrington        NaN
...                ...        ...
3235               NaN   240000.0
3236               NaN  1800000.0
3237               NaN    90000.0
3238               NaN   180000.0
3239               NaN   100000.0

[776 rows x 6 columns]

# Pembersihan data

In [6]:
# Menghapus semua baris yang memiliki nilai kosong (NaN) dari DataFrame
df_bersih = df.dropna()

# Menampilkan jumlah data (baris, kolom) setelah penghapusan missing values
print("Jumlah data setelah menghapus Missing Values:", df_bersih.shape)

Jumlah data setelah menghapus Missing Values: (2464, 6)

# Menyimpan DataFrame

In [7]:
df_bersih.to_csv('TokoBuku_Bersih.csv', index=False)
print("\nDataset bersih sudah disimpan sebagai 'TokoBuku_Bersih.csv'")

Dataset bersih sudah disimpan sebagai 'TokoBuku_Bersih.csv'